#  import the libraries

In [18]:
# importing the libraries

import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression
import matplotlib.pyplot as plt

#  loading the dataset

In [19]:
# loading the dataset

data  =  pd.read_csv("C:\\Users\\Dell\\Desktop\\sem 6\\ML\\houseprice.csv")
data

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

#  information of dataset

In [20]:
# information od dataset

data.info()
data.isnull()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   area      6 non-null      int64
 1   bedrooms  5 non-null      float64
 2   age       6 non-null      int64
 3   price     6 non-null      int64
dtypes: float64(1), int64(3)
memory usage: 320.0 bytes

    area  bedrooms    age  price
0  False     False  False  False
1  False     False  False  False
2  False      True  False  False
3  False     False  False  False
4  False     False  False  False
5  False     False  False  False

# filling/replacing the missing values

In [21]:
# filling the missing vales using mean 

data.fillna(data.mean(),inplace=True)
data

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.2   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

#  dividing the dataset into independent variables

In [22]:
# dividing the dataset into independent variable

x = pd.DataFrame(data.iloc[:,:-1])
x

   area  bedrooms  age
0  2600       3.0   20
1  3000       4.0   15
2  3200       4.2   18
3  3600       3.0   30
4  4000       5.0    8
5  4100       6.0    8

#  dividing the dataset into dependent variables

In [23]:
# dividing the dataset into dependent variable

y = pd.DataFrame(data.iloc[:,-1])
y

    price
0  550000
1  565000
2  610000
3  595000
4  760000
5  810000

#  splitting the data into testing and training set

In [24]:
# splitting the data into testing and training set

from sklearn.model_selection import train_test_split

x_train ,x_test , y_train , y_test = train_test_split(x,y,test_size = 0.2 ,random_state = 3)

#  result of x_train

In [25]:
# result of x_train

x_train

   area  bedrooms  age
4  4000       5.0    8
1  3000       4.0   15
0  2600       3.0   20
2  3200       4.2   18

#  result of x_test

In [26]:
# result of x_test

x_test

   area  bedrooms  age
3  3600       3.0   30
5  4100       6.0    8

#  result of y_train

In [27]:
# result of y_train

y_train

    price
4  760000
1  565000
0  550000
2  610000

#  result of y_test

In [28]:
# result of y_test

y_test

    price
3  595000
5  810000

#  training the algorithm

In [29]:
# training the algorithm

from sklearn.linear_model import LinearRegression
reg = LinearRegression()
reg.fit(x_train,y_train)

LinearRegression()

#  having look at the co-efficients that the model has chosen

In [30]:
# co-efficients that model has chosen

v = pd.DataFrame(reg.coef_,index=['Co-efficient']).transpose()
w = pd.DataFrame(x.columns,columns=['Attribute'])

# concatenating the dataframes to compare

In [31]:
# conactenating datapframes

coeff_df = pd.concat([w,v],axis=1)
coeff_df

  Attribute   Co-efficient
0      area     304.545455
1  bedrooms -100000.000000
2       age    1363.636364

# comparing the predicted value to the actual value

In [32]:
# comparing predicted and actual values

y_pred = reg.predict(x_test)
pd.DataFrame(y_pred,columns=['Predicted'])
y_pred

array([[868181.81818182],
       [690454.54545455]])

# evaluating the model

In [33]:
# finding mean absolute error

from sklearn import metrics
print("mean absolute error : " , metrics.mean_absolute_error(y_test,y_pred))

# finding mean squared error

print("mean squared error : " , metrics.mean_squared_error(y_test,y_pred))

# finding root mean squared error

print("root mean squared error ",np.sqrt(metrics.mean_absolute_error(y_test,y_pred)))

mean absolute error :  196363.6363636366
mean squared error :  44459710743.80176
root mean squared error  443.12936752559807